In [6]:
import pandas as pd
import numpy as np

## pd.concat():

In [9]:
data = [
    {'student_id': 'S1', 'name': 'Danniella Fenton', 'marks': 200},
    {'student_id': 'S2', 'name': 'Ryder Storey', 'marks': 210},
    {'student_id': 'S3', 'name': 'Bryce Jensen', 'marks': 190},
    {'student_id': 'S4', 'name': 'Ed Bernal', 'marks': 222},
    {'student_id': 'S5', 'name': 'Kwame Morin', 'marks': 199}
]

df1 = pd.DataFrame(data)

student_data2 = pd.DataFrame([
    {'student_id': 'S4', 'name': 'Scarlette Fisher', 'marks': 201},
    {'student_id': 'S5', 'name': 'Carla Williamson', 'marks': 200},
    {'student_id': 'S6', 'name': 'Dante Morse', 'marks': 198},
    {'student_id': 'S7', 'name': 'Kaiser William', 'marks': 219},
    {'student_id': 'S8', 'name': 'Madeeha Preston', 'marks': 201}
])

df2= pd.DataFrame(student_data2)

In [11]:
pd.concat([df1, df2], ignore_index=True)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S4  Scarlette Fisher    201
6         S5  Carla Williamson    200
7         S6       Dante Morse    198
8         S7    Kaiser William    219
9         S8   Madeeha Preston    201

## df.combine_first():

In [16]:
# DataFrame with some null values
df_nulls = pd.DataFrame({
    'date': pd.date_range('2025-08-01', periods=5, freq='D'),
    'patient_id': ['A', 'B', 'C', 'D', 'E'],
    'cholesterol': [180, np.nan, 210, np.nan, 190],
    'hdl': [55, 60, np.nan, 50, np.nan]
})

# Fully populated DataFrame
df_full = pd.DataFrame({
    'date': pd.date_range('2025-08-01', periods=5, freq='D'),
    'patient_id': ['A', 'B', 'C', 'D', 'E'],
    'cholesterol': [180, 200, 210, 195, 190],
    'hdl': [55, 60, 65, 50, 52]
})

df_nulls.combine_first(df_full)

        date patient_id  cholesterol   hdl
0 2025-08-01          A        180.0  55.0
1 2025-08-02          B        200.0  60.0
2 2025-08-03          C        210.0  65.0
3 2025-08-04          D        195.0  50.0
4 2025-08-05          E        190.0  52.0

## pd.merge():

In [25]:
df_checkup_plan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   patient_name  6 non-null      object
 1   body_part     6 non-null      object
dtypes: object(2)
memory usage: 228.0+ bytes

In [29]:
# Patient checkup plan: body parts to examine
df_checkup_plan = pd.DataFrame({
    'patient_name': ['John', 'Emily', 'David', 'Sophia', 'John', 'Emily'],
    'body_part': ['Nose', 'Ear', 'Throat', 'Eye', 'Ear', 'Eye']
})

# Checkup schedule: when each body part is examined
df_schedule = pd.DataFrame({
    'patient_name': ['John', 'Emily', 'David', 'Sophia', 'John', 'Emily'],
    'body_part': ['Nose', 'Ear', 'Throat', 'Eye', 'Ear', 'Eye'],
    'checkup_day': ['Monday', 'Wednesday', 'Tuesday', 'Friday', 'Thursday', 'Saturday']
})

pd.merge(
    df_checkup_plan,
    df_schedule,
    on=['patient_name', 'body_part'],
    how='outer'
)

  patient_name body_part checkup_day
0        David    Throat     Tuesday
1        Emily       Ear   Wednesday
2        Emily       Eye    Saturday
3         John       Ear    Thursday
4         John      Nose      Monday
5       Sophia       Eye      Friday

## pd.join():

In [32]:
bank_office_df = pd.DataFrame({
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['Aarav Shrestha', 'Bina Karki', 'Chirag Thapa', 'Deepa Gurung', 'Elina Rai'],
    'Department': ['Accounts', 'Loans', 'Customer Service', 'IT', 'Accounts'],
    'Branch': ['Kathmandu', 'Pokhara', 'Biratnagar', 'Kathmandu', 'Lalitpur'],
    'JoiningDate': pd.to_datetime(['2020-01-15', '2019-07-01', '2021-03-20', '2022-11-05', '2020-06-10']),
    'Salary': [65000, 72000, 58000, 75000, 67000],
    'PerformanceRating': ['A', 'B', 'A', 'C', 'B']
})
df_training = pd.DataFrame({
    'EmployeeID': [101, 102, 104, 106, 107],
    'TrainingCompleted': ['Yes', 'No', 'Yes', 'Yes', 'No'],
    'LastTrainingDate': pd.to_datetime(['2023-06-15', '2022-12-01', '2023-03-10', '2023-07-20', '2022-11-25']),
    'Trainer': ['Sujan Bista', 'Nisha Khadka', 'Ramesh Poudel', 'Anita Shrestha', 'Kiran Thapa']
}).set_index('EmployeeID')

bank_office_df, df_training

(   EmployeeID            Name        Department      Branch JoiningDate  \
 0         101  Aarav Shrestha          Accounts   Kathmandu  2020-01-15
 1         102      Bina Karki             Loans     Pokhara  2019-07-01
 2         103    Chirag Thapa  Customer Service  Biratnagar  2021-03-20
 3         104    Deepa Gurung                IT   Kathmandu  2022-11-05
 4         105       Elina Rai          Accounts    Lalitpur  2020-06-10

    Salary PerformanceRating
 0   65000                 A
 1   72000                 B
 2   58000                 A
 3   75000                 C
 4   67000                 B  ,
            TrainingCompleted LastTrainingDate         Trainer
 EmployeeID
 101                      Yes       2023-06-15     Sujan Bista
 102                       No       2022-12-01    Nisha Khadka
 104                      Yes       2023-03-10   Ramesh Poudel
 106                      Yes       2023-07-20  Anita Shrestha
 107                       No       2022-11-25     Kiran Thapa)

In [40]:
df = bank_office_df.set_index(['EmployeeID'])
df_training.index

Index([101, 102, 104, 106, 107], dtype='int64', name='EmployeeID')

In [58]:
df.join(df_training, on='EmployeeID')

,Name,Department,Branch,JoiningDate,Salary,PerformanceRating,TrainingCompleted,LastTrainingDate,Trainer
EmployeeID,,,,,,,,,
101,Aarav Shrestha,Accounts,Kathmandu,2020-01-15,65000,A,Yes,2023-06-15,Sujan Bista
102,Bina Karki,Loans,Pokhara,2019-07-01,72000,B,No,2022-12-01,Nisha Khadka
103,Chirag Thapa,Customer Service,Biratnagar,2021-03-20,58000,A,NaN,NaT,NaN
104,Deepa Gurung,IT,Kathmandu,2022-11-05,75000,C,Yes,2023-03-10,Ramesh Poudel
105,Elina Rai,Accounts,Lalitpur,2020-06-10,67000,B,NaN,NaT,NaN

## pd.merge_ordered():

In [59]:
df_checkup_plan,df_schedule

(  patient_name body_part
 0         John      Nose
 1        Emily       Ear
 2        David    Throat
 3       Sophia       Eye
 4         John       Ear
 5        Emily       Eye,
   patient_name body_part checkup_day
 0         John      Nose      Monday
 1        Emily       Ear   Wednesday
 2        David    Throat     Tuesday
 3       Sophia       Eye      Friday
 4         John       Ear    Thursday
 5        Emily       Eye    Saturday)

In [69]:
pd.merge_ordered(df_checkup_plan,df_schedule, on=['patient_name', 'body_part'])

  patient_name body_part checkup_day
0        David    Throat     Tuesday
1        Emily       Ear   Wednesday
2        Emily       Eye    Saturday
3         John       Ear    Thursday
4         John      Nose      Monday
5       Sophia       Eye      Friday

## pd.merge_asof():

## pd.compare():

In [75]:
df6 = df_checkup_plan[['patient_name', 'body_part']]
df7 = df_schedule[['patient_name', 'body_part']]

In [76]:
df6.compare(df7)

Empty DataFrame
Columns: []
Index: []

In [84]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}, index=['x', 'y', 'z'])
df2 = pd.DataFrame({'A': [1, 2, 4], 'B': [4, 6, 6]}, index=['x', 'y', 'z'])

df1.compare(df2, result_names=('A', 'B'))

     A         B
     A    B    A    B
y  NaN  NaN  5.0  6.0
z  3.0  4.0  NaN  NaN